{"data":{"markdownRemark":{"html":"<p><em>July 31, 2019</em></p>\n<p><img src=\"/thriving-in-chaos/one-year-1.jpg\" alt=\"Bangkok Sunset\"></p>\n<p>This week marks one year since I packed everything into a backpack and left home for good. It’s been one of the most challenging, but also one of the most rewarding and life-changing years thus far. </p>\n<p>From saying goodbye to DC for the last time, finding love in Miami, facing bedbugs and beach bum life in Portugal, Christmas markets in Belgium, one hell of a ride through northern Thailand and Laos, some extreme island chills in Cambodia, and some time to focus on work in Jakarta, this first year has been the one crazy adventure. </p>\n<p>It’s not easy to build your own business while traveling full time. I’ve managed to do alright for myself, but it hasn’t been easy. Here’s what I’ve learned from my first year on the road: </p>\n<h2>1. Living abroad doesn’t actually save you as much money as you would expect.</h2>\n<p>It’s true that you can live in a place like Vang Vieng, Chiang Mai, or Jakarta for pennies relative to the cost of living in a big US city, but I also found myself working less and spending as much as I could save on more travel or reinvesting it into my business. Maybe that’s just a personal problem, I know, but the difference in cost of living abroad didn’t automatically lead to more savings. </p>\n<p>I’ve gotten good at being more disciplined with time - my goal for year two will be to learn how to be disciplined with money while traveling. I had it down while I was living in DC and had a stable income, but it’s not so easy when your location changes every month and your income is based on how much you work, not how long you actually sit at a desk (freelancer problems).</p>\n<p><img src=\"/thriving-in-chaos/one-year-2.jpg\" alt=\"Koh Tao Sunset\"></p>\n<h2>2. Working 40 hours a week while living in a hostel or town where everyone else is on vacation is incredibly difficult.</h2>\n<p>Hell, working 40 hours a week without an external boss to make you show up every day takes an incredible amount of discipline. This year has been a long process of learning how to run my own business and be my own boss, and I’ve come out of it a lot stronger because of it. You can’t underemphasize the power of routine, especially when you’re constantly on the move. </p>\n<p>Your routine will look different depending on your environment and the people you’re around, but it’s impossible to function without one, and that kind of discipline takes practice. </p>\n<p>In Spain, I worked US hours (night shift), so my working hours some nights were from 11:45pm-4:00am (#barf). That meant, for the rest of my hours, if I wanted to get an appropriate amount of sleep, I wasn’t getting started much before 2pm, which was really tough for me as a morning person. </p>\n<p>In Thailand and Laos, I did my best to do four days on, three days off, where I worked four 10-hour days, and then didn’t touch my laptop for another three.</p>\n<p>In Jakarta, I wake up at 7:30, work from 8:00am-12:00pm, exercise from 12:30-2:00pm, and then work some more from 2:30-6:30pm. It doesn’t look all that much different than my office life, but I choose where and when I work. </p>\n<h2>3. Being a ‘digital nomad’ seems cool in theory, but comes along with a lot of sacrifice.</h2>\n<p>You have to be deliberate and, at times, ruthless about what’s important to you, even when it sucks. It’s a growing counterculture, but a counterculture nonetheless. You picked this life for a reason. </p>\n<p>You also have to be honest with yourself about what’s working for you and what’s not, even if it doesn’t align with your life as you once imagined it. If the hostel or place where you live isn’t doing it for you, you can leave. If that friendship or relationship is no longer giving you the joy it once did, leave. Or if you can’t leave, be true to yourself and be honest about why you’re making those choices. </p>\n<p>It’s okay for your priorities to shift over time, and to feel lost in the process. Digital nomad life can be fast and chaotic, but it remains critically important to make time and space for yourself to be grounded.</p>\n<h2>4. Digital nomad life on Instagram is incredibly glamorous. Digital nomad life in reality is the opposite.</h2>\n<p>Yes, there are gorgeous beaches and epic adventures, but what you don’t see is the 5am phone calls because your client is on US hours, or me working from McDonalds because it’s the only place with wifi, or saying no to really cool plans because there’s no internet or cell service in that part of the country or you simply have too much work. In Jakarta, I spend 20 hours a day in the same spot because there’s air conditioning and wifi here, and going outside into the chaos of this city is too mentally draining after 8 hours of work. </p>\n<p>If it works for you, it works for you, but it sure isn’t always pretty. </p>\n<h2>5. The best thing about being a ‘digital nomad’ is the digital part, not the nomad part.</h2>\n<p>Being able to work from home, on your own schedule, is amazing. You have complete control (for the most part) over how you structure your life, so you essentially have complete freedom. The hard part is continuously having to relocate, every few days or weeks. You have to work out all the logistics of getting there, take one of your days off to go there, learn the neighborhood food spots, grocery stores, and cool hangout spots all over again, and structure a brand new routine around that place. And it’s even harder if you’re changing time zones.</p>\n<p>But you do it again, and again, and again. </p>\n<p>I have it easier than some other ‘digital nomad’ types who have built their businesses and lives around constant change, but I still crave change and choose to move on every month or so. </p>\n<p>It isn’t easy - the digital lifestyle is much more effective if you move slower. I’ve found my personal minimum time to spend in one spot is about 2-3 weeks, rather than 2-3 days like the rest of the backpacker crowd. </p>\n<p>Overall though, making the shift from the traditional rat race to one of my own design has been well worth everything I’ve had to sacrifice to get here - stability, my social life, and my sense of routine. I don’t have plans to stop any time soon, although I do have plans to slow down and take more time in each place. The beauty of this life is that I can just follow where the wind takes me, and I can’t wait to see where I wind up next. </p>\n<hr>\n<p>If you made it this far, thanks for reading! I built this site myself and I (still) don’t have commenting set up yet, but if you’ve got any comments, feedback, or travel suggestions, head over to this Instagram post and drop it in the comments there!</p>\n<p>If you learned something, please don’t forget to share ♥</p>","frontmatter":{"title":"Thriving in Chaos: Lessons from my First Year as a Nomad"}}},"pageContext":{"slug":"/thriving-in-chaos-first-year-as-a-nomad/"}}