{"data":{"markdownRemark":{"html":"<p><em>August 1, 2019</em></p>\n<p>This is one of the questions about life on the road that I get asked most frequently - when you’re traveling for so long, do you stay at hostels? Airbnbs? Hotels? Somewhere else? The answer is actually all of the above! </p>\n<p>I’ve been fully nomadic since July 2018, and semi-nomadic for a long time before that. I’ve spent more than a year of my life in hostel dorms, so I’ve gotten my process down almost to a science. </p>\n<p>Here are a few of the things I consider when picking a place to stay while traveling: </p>\n<h2>1. Does it have a quiet place where I can work? (or if not, is there someplace nearby, like a coworking space?)</h2>\n<p>If I’m picking out a hostel, I don’t really look at the rooms themselves other than to make sure it looks clean and decent. What I’m really looking for are the common areas. Are there a lot of couches or tables where I’ll be able to work? Is there more than one common space? Is there going to be a quiet place here where I’ll be able to make calls at weird hours? Is this one of those annoying hostels that closes all their common spaces between 10pm and 8am? (looking at you, Urban Holiday Lofts in Chicago). </p>\n<p>If the facilities aren’t that nice, is there a (cheap) coworking space nearby, or at least a lot of coffee shops where I can sit for the afternoon? </p>\n<p><img src=\"/dn-accom/chiang-mai-sunset.jpg\" alt=\"Chiang Mai Sunset\"></p>\n<h2>2. Is it close to a place where I actually want to stay or accessible to the city’s public transportation?</h2>\n<p>This one can be tricky, depending on the city. Do your research and figure out what you might want to see and do besides working while you’re there. I’m not really a huge partier, so I definitely don’t want to be on the main bar streets, but I also will probably go there at some point so I also don’t want to be out in the middle of nowhere. Anywhere between a 10-15 minute walk quick or Uber ride to the city center or to the beach will do. </p>\n<h2>3. What are the amenities like? (aka does it have a pool and free breakfast)</h2>\n<p>As a working nomad, fast wifi is non-negotiable. Free breakfast is a must. It’s great to meet people, and then I don’t have to get out of bed and leave the property when I get hangry in the mornings. Free (or cheap) community dinners are also great, both for my budget and for my social life.</p>\n<p>Other things that are nice: </p>\n<ul>\n<li>A big comfy common space with a lot of couches (been making couch dents around the world since 2018)</li>\n<li>A pool (or at least a outdoor terrace where I can work while soaking up some vitamin D)</li>\n<li>Curtains on the beds for some privacy</li>\n<li>A gym (this is usually a stretch with hostels but always a welcome plus)</li>\n<li>24-hour reception (check out my guide to <a href=\"./how-to-pick-a-hostel-solo-female-traveler.md\">picking out a hostel as a solo female traveler</a>to find out why)</li>\n</ul>\n<p><img src=\"/dn-accom/248-pool.jpg\" alt=\"248-street pool\"></p>\n<h2>4. Will it be easy for me to meet other travelers?</h2>\n<p>Even though I’m traveling, I’m still working full time. I can’t exactly stay at a party hostel where everyone starts drinking at breakfast, but I try to find ones that won’t be completely dead either. Good staff and hostel-sponsored events like dinners and pub crawls are typically key to being able to meet other travelers easily.</p>\n<p>If I’m traveling by myself, I generally avoid hotels and Airbnbs. Since I’m already alone, being isolated in an Airbnb instead of around plenty of other people can be pretty lonely. However, that doesn’t mean I won’t go for it after a long string of bad hostel roommates when I’ve had enough with dorms for a while, or if I need to get a lot of work done without distractions. </p>\n<p>Typically, you may not be able to meet all of these requirements, depending on what’s available in each place you want to visit. If you can, that’s awesome! (Hello, Top City Hostel in Lagos, Portugal). However, if the perfect place doesn’t exist, you may have to take another look at your list of requirements and compromise about what’s most important to you, or even consider changing destinations altogether (I’ve done both!) </p>\n<p>After all, the right accommodation will influence who you meet in your travels, and can truly make or break your experience of a city. </p>\n<p>Choose wisely!</p>\n<p>If you made it this far, thanks for reading! Check out the following posts for more on how to pick the perfect hostel: </p>\n<p><a href=\"./how-to-pick-a-hostel-solo-female-traveler.md\">How to Pick a Hostel as a Solo Female Traveler</a></p>","frontmatter":{"title":"How to Pick Accommodation as a Digital Nomad"}}},"pageContext":{"slug":"/pick-accommodation-as-a-digital-nomad/"}}