{"data":{"markdownRemark":{"html":"<p><em>February 15, 2019</em></p>\n<hr>\n<p>Github Pages only serves static files (html, css, js), which means that it doesn’t know what to do with all of the files created by create-react-app. However, that doesn’t mean you can’t deploy and show off your React app.</p>\n<p>Here’s how you get your React app up and running on Github Pages:</p>\n<p><strong>1</strong>. Create a Git repository if you don't already have one. You can check this by running <code>git status</code>.</p>\n<p><strong>2</strong>. Create a new branch, add and commit your changes, and then push it to Github:</p>\n<p><code>git checkout -b development</code></p>\n<p><code>git add .</code></p>\n<p><code>git commit -m 'created development branch</code></p>\n<p><code>git push origin development</code></p>\n<p>Github Pages deploys whatever is in your master branch, so we want to make sure that there are only static files present. We’ll do this by saving all the substance of your React app on the <em>development</em> branch, and re-creating the master branch so that it only contains static files.</p>\n<p><strong>3</strong>. Navigate to your repository on Github, click on the Branches tab, and then click ‘Change Default Branch’. Set it to <em>development.</em></p>\n<p><img src=\"/gh-pages/1.png\" alt=\"Change default branch\"></p>\n<p><img src=\"/gh-pages/2.png\" alt=\"Change default branch\"></p>\n<p><strong>4</strong>. Delete your master branch on Github. (Don't worry - you've still got one locally)</p>\n<p><img src=\"/gh-pages/3.png\" alt=\"Delete master branch\"></p>\n<p><strong>5</strong>. Switch back to your terminal, and run the following, depending on your package manager of choice:</p>\n<p><code>npm install gh-pages --save-dev</code></p>\n<p>or</p>\n<p><code>yarn add gh-pages --dev</code></p>\n<p><strong>6</strong>. Add the following script to your <em>package.json</em>:</p>\n<p><code>\"deploy\": \"gh-pages -d build -b master\"</code></p>\n<p>This script utilizes the <code>gh-pages</code> module to create a production build for your React app, push it onto your master branch, and then push it to Github for you.</p>\n<p>Your <em>package.json</em> should now contain something that looks like this: </p>\n<pre><code>{ \n  “name”: “my-repo-name”, \n  “description”: “my-first-react-app”, \n  “license”: “MIT”,\n  “scripts”: { \n    “start”: “npm run start”, \n    “build”: “npm run build”, \n    “deploy”: “gh-pages -d build -b master”, \n  }, \n  “dependencies”: { \n     ...\n  },\n  \"devDependencies\": {\n    \"gh-pages\": \"^2.0.1\"\n  }\n}\n</code></pre>\n<p>This will also work to deploy a site built with Gatsby. The only difference is to replace the script in your <em>package.json</em> with the following:</p>\n<p>`\"deploy\": \"gatsby build &#x26;&#x26; gh-pages -d public -b master\"</p>\n<p><strong>7</strong>. Run the following command in your terminal: </p>\n<p><code>yarn deploy</code> </p>\n<p>or </p>\n<p><code>npm run deploy</code></p>\n<p>At this stage, you may get an error that says 'build directory does not exist'. If that happens, just create a new directory named <code>build</code> at the root of your application and run the command again.</p>\n<p>If you get an error saying that the 'pattern in <code>src</code> does not match component pattern' at this stage, make sure that all the files and directories in your React app are at the root of the directory where you initialized your Git repository. </p>\n<p><strong>8</strong>. Confirm that your master branch now only contains static, minified html, js, and css files.</p>\n<p><img src=\"/gh-pages/4.png\" alt=\"Check your master\">\n<img src=\"/gh-pages/5.png\" alt=\"Check your development\"></p>\n<p><strong>9</strong>. Click the setting tab, and scroll down to the Github Pages section. Select your master branch from the dropdown menu under Source, and click save.</p>\n<p><img src=\"/gh-pages/6.png\" alt=\"Publish\"></p>\n<p>You should now be able to view your site at the URL provided in the green bar in the Github Pages section. I’ve pointed mine at a custom domain, but Github Pages will provide you with a github.io link by default.</p>\n<p>It may take a few minutes for the content to update (especially if you’re using a custom domain).</p>\n<p><img src=\"/gh-pages/7.png\" alt=\"Finished\"></p>\n<p>Congratulations, you’ve just successfully deployed your first React app using Github Pages!</p>\n<hr>\n<p><em>Thanks so much for reading! This is my first tutorial so if you have any feedback, please don’t hesitate to let me know how I can improve! I built this blog myself and I don't have commenting set up yet, but you can drop me a line on Instagram at</em> <a href=\"https://instagram.com/bubu_backpacks\">@bubu_backpacks</a>_</p>","frontmatter":{"title":"Deploy Your React App on Github Pages"}}},"pageContext":{"slug":"/deploy-your-react-app-on-github-pages/"}}