{"data":{"markdownRemark":{"html":"<p><img src=\"/images/recap-photos/cover-photo.jpg\" alt=\"Barcelona\"></p>\n<p>For those of you who have been following along, you may know that I made some pretty major changes to my life this year, and I can honestly say it’s been one of the greatest years of my life. It’s mind-blowing to think that this time last year, I was sitting in my windowless office planning travel and helping other people run their business, and now I’m not only running one of my own, but I’m planning to continue expanding and rebranding well into 2019 and beyond.</p>\n<p>This year, I</p>\n<ul style=\"margin-left: 3vw;\" >\n <li>-  Got my first paid travel writing gig</li>\n <li>-  Quit my job</li>\n <li>-  Sold or donated all of my belongings and moved out of my Washington DC apartment</li>\n <li>-  Spent 12 weeks studying web development at General Assembly in Chicago</li>\n <li>-  Started working as a freelance developer</li>\n <li>-  Traveled (slowly) for almost six months</li>\n <li>-  Said goodbye to old friends, and hello to some new ones</li>\n <li>-  Met my newest favorite adventure partner</li>\n <li>-  Learned just how much I am capable of accomplishing</li>\n </ul>\n<br />\n<p>Needless to say, it was crazy busy but also incredibly rewarding to look back at just how much has changed and how far I’ve come.</p>\n<div style=\"display: flex; justify-content: center;\">\n    <img src=\"/images/recap-photos/windowsill.jpg\" style=\"max-height: 70vh; margin-left: auto; margin-right: auto;\">\n</div>\n<h3>January 2018 - Washington, DC</h3>\n<p>The first two months of this year were a blur. In January, I had already made up my mind to quit my job but I hadn’t told anyone outside of my family and close friends yet, so I was stuck inside this bizarre limbo of starting to sell my belongings and downsize my life, keep up with my blog, teach myself to code, while simultaneously going about my day at work like everything was normal.</p>\n<p>Then, just a few days short of the end of the month, I put in my notice at work and announced that I would be leaving at the end of February. It was like a tremendous weight had been lifted off my shoulders and finally, I was <em>free</em>. Even though I had a month left to go and a tremendous amount of work to do before I left, when the realization hit me on my commute home from work that day, I was more relieved and happy than I’d ever been in my life up to that point.</p>\n<p>From this point forward I would be living my life on exclusively my own terms, because I wanted this path more than anything else in the world.</p>\n<p><img src=\"/images/recap-photos/CapitolReflection.jpg\" alt=\"Washington\"></p>\n<h3>February 2018 - Washington DC</h3>\n<p>A funny thing happens when you downsize your material belongings and rid your life of clutter - you leave behind more than just the physical, but also the emotional clutter that you didn’t even realize was taking up so much of your energy. February was a weird month of packing, trying to fit in everything I wanted to do in DC before I left, goodbyes, and non-goodbyes, but it felt good to close that chapter of my life and start fresh.</p>\n<div style=\"display: flex; justify-content: center;\">\n    <img src=\"/images/recap-photos/airport.jpg\" style=\"max-height: 70vh; margin-left: auto; margin-right: auto;\">\n</div>\n<h3>March - June 2018 - Chicago</h3>\n<p>I moved back to Chicago to rediscover my old home and fully jump in to my new path as a freelance web developer in a fresh, positive environment. I went through the 12-week full-time Web Development Immersive program at General Assembly, which was like drinking out of a firehose (more about this experience later). I basically spent 10-12 hours a day learning how to code, how to network, or how to brand myself, every single day for three months. Through this experience, I met some great new friends and expanded my network tremendously.</p>\n<p>Three months and several identity crises later, I was ready to hit the streets as a newly minted developer.</p>\n<p>Applying for jobs, sending in proposals for remote contract work, trying to network, keeping up with friends, learning new things, maintaining my blog, and still trying to code every day was a LOT of work in June and the first part of July, but it was absolutely worth it. There were (and still are) days where I could easily spend 10-14 hours working away on code projects or blog work without even realizing because I’m having so much fun.</p>\n<p>I’m all about a healthy work-life balance and I’m not saying that working that much is necessarily good (and now I work much less), but it was an incredibly fun and incredibly productive few weeks and I wouldn’t change a thing.</p>\n<p><img src=\"/images/recap-photos/chicago.jpg\" alt=\"Chicago\"></p>\n<h3>July 2018 - Washington, DC</h3>\n<p>Finally the day had come - I was starting to get some income coming in from remote client work, so it was time to pack my life into a backpack and hit the road.</p>\n<p>I was so excited. I remember sitting in the airport with that giddy, little-kid-on-Christmas-eve type feeling in my stomach while I was waiting to board. But, once I looked out over DC from the airplane window as I had so many times before, I was hit with a wave of nostalgia.</p>\n<p>It was as if my last few years in DC had been a pit of struggle, but I had never even realized how bad it was until after I had left for a while to pursue a life that I was actually passionate about. I’d come so far in just a few short months, and once I left DC for good after that week, I was never coming back.</p>\n<p><img src=\"/images/recap-photos/WWIIMemorial.jpg\" alt=\"WWII\"></p>\n<h3>August 2018 - Boston, Miami, Key West (pt. 1), and Chicago</h3>\n<p>I spent the first half of August derping through Boston, Miami, and Key West with none other than my all-time favorite adventure buddy Smol Trash to celebrate our five year friendiversary. We rented a car and drove down to Key West to enjoy the slow pace of island life, managed to be (much) less hungover than our last adventure, and learned the hard way that you should <em>always</em> google your boo.</p>\n<p>This was also when I stopped updating my blog regularly, partly because I was traveling more and picking up more work, and partly due to safety concerns that came along with sharing my current location. I’ve been stockpiling some posts and rebranding for 2019, so get excited for some (slightly post-dated) stories coming very soon.</p>\n<p>The second highlight of the month was coming back to Chicago for a brief visit to attend the Voice of Blockchain conference. For those of you who don’t know, one of the projects I’ve been working on is Urban Array, an ambitious community of folks aiming to bring blockchain into the social enterprise and community development sphere. Attending Voice of Blockchain and representing Urban Array gave me the opportunity to connect with folks working on exciting projects in similar spaces, from blockchain-based voting to the complete decentralization of identity and even a new model of the nation-state (read my thoughts on blockchain and the nation-state here).</p>\n<div style=\"display: flex; justify-content: center;\">\n    <img src=\"/images/recap-photos/keywest.jpg\" style=\"max-height: 70vh; margin-left: auto; margin-right: auto;\">\n</div>\n<div style=\"display: flex; justify-content: center;\">\n    <img src=\"/images/recap-photos/blockchain.jpg\" style=\"max-height: 70vh; margin-left: auto; margin-right: auto;\">\n</div>\n<p style=\"text-align: center; font-size: 14px;\"><em>\n    Four women on a panel (that wasn't even about diversity!) at a Blockchain conference - my heart was so happy.\n</em></p>\n<h3>September 2018 - New Orleans, Miami, Key West (pt. 2), Lisbon</h3>\n<p>First of all, New Orleans is a fascinating microcosm of culture, tourism, social stratification, and history and it is 100 percent worth a visit. If you go, you should absolutely stay at India House Hostel, hands down the best hostel I’ve ever stayed at (and I’ve spent almost a year living in hostels at this point).</p>\n<div style=\"display: flex;\">\n    <img src='/images/recap-photos/neworleans1.jpg' style=\"max-height: 57vh\">\n    <img src='/images/recap-photos/neworleans2.jpg' style=\"margin-left: 2vh; max-height:57vh;\">\n</div>\n<p>I was a bit hesitant to go back to Miami but I’m so glad I did. Approximately 10 days before leaving the country, I met my new adventure partner. We took a spontaneous road trip down to Key West for the weekend, and have been (for the most part) traveling together ever since.</p>\n<p><img src=\"/images/recap-photos/keywest2.jpg\" alt=\"KeyWest\"></p>\n<p>All of a sudden, it was September 19th - the date on the ticket I’d booked months before while I was muddling through bootcamp and wondering if I’d ever be able to wrap my head around React whatever the heck Express and Node were to become successful as a developer. I landed in Lisbon and was back in my element - on my own in a brand new place. I had my ‘office’ packed into my backpack, was prepared to work anywhere and everywhere, and have a new adventure every day.</p>\n<div style=\"display: flex; justify-content: center;\">\n    <img src=\"/images/recap-photos/belem.jpg\" style=\"max-height: 70vh; margin-left: auto; margin-right: auto;\">\n</div>\n<h3>October 2018 - Lisbon, Lagos, Seville</h3>\n<p>There’s no greater sign that it’s time to move than getting fired by a client (who builds an API with Rack and then hires someone with zero experience to fix it?), getting bedbugs (gross), and dropping your phone down a flight of stone stairs (it didn’t just shatter, the glass fell out) in the space of one week, so I bought a bus ticket and headed south.</p>\n<p>Lagos, Portugal is a small, relatively touristy town on the southeastern tip of Portugal. It also happens to be located approximately 45 minutes by car from Benagil cave, the place that had been the desktop background on my work computer back in Washington while I was planning this whole adventure. Sitting in that cave staring up at the ceiling was so surreal - I’d stared at this place longingly for <em>months</em> and now I was really here.</p>\n<div style=\"display: flex; justify-content: center;\">\n    <img src=\"/images/recap-photos/benagil.jpg\" style=\"max-height: 70vh; margin-left: auto; margin-right: auto;\">\n</div>\n<p>I loved Lagos, the hostel I stayed at while I was there, the beaches, and the people I met there. Someday, I’ll go back to Portugal and spend more time exploring the coastline and all the beautiful places it has to offer.</p>\n<p>But I had to head east, so I stopped in Seville for the weekend. It was the first time I’d taken a long weekend off to really be a tourist, and it was a beautiful reminder of why I started doing this in the first place. I hit the walking tour, the Alcazar, and the pub crawl (in the true backpacker spirit), and met somebody who grew up in my hometown. It was a great introduction to Spain - a new place, but one where I could (mostly) understand the language.</p>\n<p>And then, all I had to do was link up with a familiar face.</p>\n<h3>November 2018 - Marbella, Granada, Gibraltar, Malaga</h3>\n<p>We spent most of November laying low in Marbella - working, figuring out how to live together, traveling a little, and laughing a lot.</p>\n<p>Granada is awesome. It was a dream come true to visit the Alhambra and all of the places I’d spent my high school years reading about in Spanish class. And even more than that, I was starting to fall in love with Spanish food. We were happily surprised by the restaurants that give you a free tapa with every drink, so we spent most of our time there eating and drinking our way through the town center when we weren’t exploring.</p>\n<p>We hiked the Caminito del Rey, a walking path built into the side of a cliff, and it was something else. I made the mistake of watching videos of people hiking the Caminito before it was restored, and definitely spent the whole two hour drive up wondering what I had gotten myself into. Thankfully, the path has been restored so you no longer have to walk across one i-beam in the treacherous spots where the old path has fallen out, hundreds of feet up in the air. It’s now perfectly safe and very, very cool.</p>\n<p>We celebrated Thanksgiving at the house in Marbella, and it was nice to have a little touch of home despite being thousands of miles away. (We bought the Thanksgiving chicken pre-cooked, but I made everything else and it was a pretty successful first attempt at cooking the full Thanksgiving dinner by myself).</p>\n<p> For our last weekend before leaving Marbella, we took a spontaneous day trip to Gibraltar. However, being the master procrastinators and lollygaggers that we are, we arrived in Gibraltar at 4pm, with plans to quickly run to the top of the rock to catch the sunset at 6pm. The weather did not cooperate and we didn’t realize you had to pay to walk through the preserve, so we decided to cut our losses and walk back down, especially since it was starting to rain. This ended up being a great decision, because it took us past the most stunning sunset I’ve ever seen. Plus, we shared the walk with some of the monkeys that make Gibraltar famous, so take that, expensive nature preserve!</p>\n<p>We closed out November in Malaga, a bigger city on the southern coast of Spain and my favorite city from the whole three months I spent in Europe this time around. It’s small but not too small, right on the water, home to some fascinating history, and even more gorgeous views. Spain has an awesome visa program for nomads, so at some point, it might even be a city I call home.</p>\n<h3>December 2018 - Madrid, Toledo, Barcelona, Belgium, Chicago</h3>\n<p>We got back to hardcore touristing for the first half of the month. Madrid was the coldest place I’d been on the whole trip until that point, so we had to stop and buy some warmer clothes so we could spend a few days traipsing around outdoors.</p>\n<p>We didn’t see any windmills in Toledo (they’re actually further south), but my inner Spanish art, history, and literature nerd was so happy, and the scenery was next level. I fell in love with the Damascus gold in every shop window lining Toledo’s winding streets, and can’t wait to go back someday when I can afford some (and be able to transport it back home, since by this point my bag was more than overflowing).</p>\n<p>My inner nerd was even happier in Barcelona, where we spent a few days appreciating the unique Gaudi architecture at every turn, and of course, our last few days of Spanish food before heading back to Belgium.</p>\n<p>There’s nothing better than a European city at Christmas time, and Brussels and Leuven were no exception. I definitely neglected my work a little more than I’d like to admit as we ate and drank our weight in neusekes, mulled wine, and genever.</p>\n<p>And finally, after nearly a month of moving every 2-3 days, I was on a plane back home for the holidays after an exhausting five months of travel.</p>\n<p>I’ll be in Chicago until mid-February to enjoy some face time with family and friends and plan my business goals before setting off on another 10 months of travel for the rest of 2019.  Being able to do what I love and get paid for it is one of the most awesome things in the world, and it’s my biggest success from this year. A year ago, I was trying to fit my life into my work schedule. Now, I finally have the flexibility to create my work schedule to fit into my life.</p>\n<p>It sure hasn’t been easy, but I wouldn’t change a thing.</p>\n<p>Here’s to an even better 2019!</p>","frontmatter":{"title":"Where in the world is Hanna? A 2018 Recap"}}},"pageContext":{"slug":"/2018-recap/"}}