{"data":{"markdownRemark":{"html":"<p><img src=\"https://images.unsplash.com/photo-1515476084989-0c8f073ea169?ixlib=rb-0.3.5&#x26;ixid=eyJhcHBfaWQiOjEyMDd9&#x26;s=544b788843cc31f0f4152f2d3d8fbcbd&#x26;auto=format&#x26;fit=crop&#x26;w=1031&#x26;q=80\" alt=\"passport-privilege\"></p>\n<p>I’m about to get controversial here and write about travel and privilege.</p>\n<p>I’m a strong believer in the fact that travel is about so much more than just ticking countries and sights off a list. There’s a tremendous amount of privilege that goes in to being able to country-hop, ticking wonders of world off your bucket list and listing 86/195 in your Instagram bio. A lot of my travel happens because I impulsively buy plane tickets when I get bored and frustrated with not making progress with my life, but for the majority of the world’s citizens, international travel isn’t something you can just do on a whim.</p>\n<p>I have the tremendous privilege of being born to American parents and holding that treasured blue passport. That means I can travel to a significant portion of the world, visa-free or with an easily obtained visa. While freedom of movement is critical for the international economy to function, international travel is much more difficult for the majority of the world’s population.</p>\n<p>The country with the strongest passport in the world is Singapore, whose citizens can visit 166 countries visa-free or with the ability to obtain a visa on arrival. However Americans, Brits, western Europeans, Canadians, Australians, New Zealanders, South Koreans, the Japanese, and Malaysians can travel to the vast majority of the world on a tourist visa without really batting an eye. Our dollars buy things like airfare and hotel stays with relative ease, and travel is becoming more and more accessible for our middle class populations.</p>\n<p>You can check out the rest of the Global Passport Index <a href=\"https://www.passportindex.org/byRank.php\">here</a>.</p>\n<p>Nomad Capitalist has a different but equally as fascinating ranking of passport power, which takes additional factors such as taxation and dual citizenship into account. You can read that list, along with the full methodology <a href=\"https://s3-eu-west-1.amazonaws.com/nomadcapitalist/nomad_passport_index_2018_.pdf\">here</a>. (This is not an endorsement of any of the other content on the Nomad Capitalist platform)</p>\n<p>Many countries are part of reciprocal Visa Waiver Programs, meaning that their citizens can travel to countries on the list as a tourist for up to 90 days visa-free. You can check out the full list of countries that can visit the United States visa-free (and US citizens can visit without a visa) <a href=\"https://travel.state.gov/content/travel/en/us-visas/tourism-visit/visa-waiver-program.html\">here</a>. If your country isn’t on the list, however, you might be out of luck. While US citizens may be able to visit your country without a visa or obtain a visa on arrival, the process is much more difficult for a non-US citizen trying to visit the US.</p>\n<p>I was completely naive to this privilege when I first started traveling. When I was in Croatia, one of my friends I met along the way kept half-joking that we should get married so that he could come visit the US, because it was hard for him to even get a tourist visa. In order to do so, he had to:</p>\n<p>Pay a $160 visa application fee\nSchedule an appointment at a US Embassy (if you don’t live in the capital, this can be a trip in itself)\nAttend the appointment with:\nCurrent and all of your previous passports\nCurrent proof of income, tax payments, property or business ownership, or assets.\nYour travel itinerary\nA letter from your employer detailing your position, salary, how long you have been employed, any authorized vacation, and the business purpose, if any, of your U.S. trip.\nCriminal/court records pertaining to any arrest or conviction anywhere, even if you completed your sentence or were later pardoned.\nIf you’re a student:\nyour latest school results, transcripts and degrees/diplomas. Also bring evidence of financial support such as monthly bank statements, fixed deposit slips, or other evidence.\nIf you’re a working adult:\nBring an employment letter from your employer and pay slips from the most recent three months.\nIf you’re visiting a relative in the US:\nBring photocopies of your relative’s proof of status (e.g. Green Card, naturalization certificate, valid visa, etc).\nAt this appointment, the consular officer will evaluate your specific intentions, family situation, and your long-term plans and prospects in your country of residence and determine whether or not you are fit to receive a tourist visa to enter the United States.</p>\n<p>This isn’t saying that it’s impossible to get into the United States on a tourist visa if your country isn’t part of the Visa Waiver Program. It’s definitely not, and if your country of origin is one that has fewer restrictions with the US, you might be more lucky and have a simplified process.</p>\n<p>The point that I’m trying to make is that because I hold an American passport, it is far easier for me to spontaneously travel to a foreign country with little preparation. Even though my bank balance is looking kind of sad these days because I’m still working to build up my freelance client base (shameless plug – if you need a website hit me up), my USD bank balance makes it relatively easy for me to buy or rent an onward ticket to my next destination and still meet the minimum necessary for entry.</p>\n<p>In the case of my Croatian friend, all I needed to do in order to visit his country was show up at the border or the airport and get my passport stamped, whereas the process is much more difficult for him to visit mine.</p>\n<p>There are many pros and cons to ease of movement between countries, and I won’t bore you with all of them here (commerce, information flows, cross-cultural exchange, etc. vs security and protectionism, etc.). While travel is supposed to be the ‘great equalizer’, the ability and privilege to travel is inherently unequal.</p>\n<p>You see all these ‘influencers’ on Instagram just posting pictures of beautiful, fashionable people in far off locations, but how many of them actually stopped and had a meaningful conversation with a local? How many of them stepped outside the resort bubble and at least attempted to experience what day-to-day life is like in that country for the people who aren’t on vacation? What are their hopes, fears, and dreams for the future?</p>\n<p>Between this and the voluntourism (a whole separate issue on it’s own), counting your countries and bragging about how many you’ve visited is just another manifestation of the colonialism and immense privilege. I’m not saying that as someone who holds an American or strong European passport that you shouldn’t travel (obviously), and I’m not saying that you should feel guilty about the number of places you’ve been or plan to go.</p>\n<p>I challenge you to challenge yourself. Put yourself through the same scrutiny that non-Visa Waiver Program countries’ citizens go through in order to visit your country. Articulate what your purpose is in each new place, and challenge yourself to get to know the country, the people, and challenges they face on a day to day basis, even if that means visiting the same place over and over again, instead of going somewhere new to cross it off your list.</p>\n<p>Check your privilege, and acknowledge it. Acknowledge that visiting new places is a huge accomplishment that can dramatically shape who you are as a person, but also acknowledge the structures in place that allowed you to do so.</p>\n<p><img src=\"https://bububackpacks.files.wordpress.com/2018/07/steven-lewis-342-unsplash.jpg?w=700\" alt=\"travel-image\"></p>\n<p>If you’re looking for some help on how to check your privilege and use it to amplify the voices of others, check out <a href=\"https://www.instagram.com/p/BlOXRcbA60j/\">this post</a> from Kiona, the voice of How Not To Travel Like a Basic Bitch, which was the inspiration that led me to finally finish writing this piece about passport privilege, something that’s been bothering me for a long time but I haven’t been able to articulate (and <a href=\"https://hownottotravellikeabasicbitch.com/\">check out her blog too</a>). She’s fantastic, and if you don’t already follow her, you absolutely should.</p>\n<p>I’m always looking for new people to follow who will challenge my worldview, remind me to check my privilege, and help me to grow into a better person. Let me know who inspires you below in the comments!</p>\n<p>Xoxo,</p>\n<p>Hanna (Bubu Backpacks)</p>\n<p>I didn’t take any of the photos in this post – they’re from <a href=\"https://unsplash.com/search/photos/passport?utm_source=unsplash&#x26;utm_medium=referral&#x26;utm_content=creditCopyText\">Unsplash</a>, an awesome free stock photo resource for digital creatives. The featured photo is by by <a href=\"https://unsplash.com/photos/YGGwRdUKv5c?utm_source=unsplash&#x26;utm_medium=referral&#x26;utm_content=creditCopyText\">Jordan Madrid</a> and the one at the end is by <a href=\"https://unsplash.com/photos/r4He4Btlsro?utm_source=unsplash&#x26;utm_medium=referral&#x26;utm_content=creditCopyText\">Steven Lewis</a>. Not an affiliate link – just something I think is cool and want to share it with y’all.</p>","frontmatter":{"title":"Check Your Passport Privilege"}}},"pageContext":{"slug":"/pandas-and-bananas/"}}