{"data":{"markdownRemark":{"html":"<p><img src=\"https://images.unsplash.com/photo-1484417894907-623942c8ee29?ixlib=rb-0.3.5&#x26;ixid=eyJhcHBfaWQiOjEyMDd9&#x26;s=3f1d38bbdda690e28a81673c06325075&#x26;auto=format&#x26;fit=crop&#x26;w=1489&#x26;q=80\" alt=\"digital-nomads\"></p>\n<p>I’ve said this before and I’m sure I’ll say it again, but the 9-to-5 is dead. Given today’s technologies, the 9-to-5 static office model has become obsolete for many industries. For example, many tech companies already have teams of software developers around the world, so it’s just a matter of restructuring your company to keep up with modern, connected workforce and geoarbitrage.</p>\n<p>Unless your industry involves physically interacting with your customers, there’s no need to have fixed hours in a fixed location. The benefits of having a distributed team are innumerable, including some of the big ones, like:</p>\n<ul>\n<li>No commute time for your employees (other than to / from a coworking space, if they choose) and thus lower greenhouse gas emissions from driving, and more time for your employees to spend with friends and family outside of work.</li>\n<li>No costly office space, lowering overhead for small companies.</li>\n<li>Employees can work from their preferred work environment, making them more productive overall and cutting down on the distractions that typically arise in the office.</li>\n<li>Employees are free to live somewhere with a lower cost of living rather than the prime real estate of a major metropolitan area, if they choose.</li>\n<li>Your company has larger talent pool to choose from once you’re no longer limited to physical location and thus can bring in the best and the brightest.</li>\n</ul>\n<p>As many industries shift in this direction, they will inevitably run into one of the biggest management challenges of the 21st century: how do you effectively run a distributed team and manage people who are not in the same physical location? Tools like Basecamp, Trello, Slack, Google Hangouts, and many other project management and communication tools make it easier than ever before to keep your team members up-to-date with what you’re working on and allow your company to operate asynchronously. It’s challenging when your team is located across widely different time zones, but it gets easier once your company is set up to efficiently function that way.</p>\n<p>What this looks like will vary widely between industries and companies. For example, if you need someone to be available all the time to respond to customer inquiries and needs, it makes sense to have part of your team in Asia, someone in North or South America, and someone in Europe so that you have all your time zones covered and always have someone available to respond. If your projects can be completed asynchronously, it can potentially save time for the client to have your Europe-based team hand off their work to the West Coast or Asia-based team at the end of their workday, effectively cutting delivery time in half if managed correctly.</p>\n<p>A big part of this challenge is cultivating a company culture that is remote-friendly. In addition to promoting clear and consistent channels of communication, supporting work-life balance becomes infinitely more important when your team is not physically located in the office. Many people who work from home find themselves logging far more hours than they would if they were in the office because it becomes harder to separate work time from personal time. Again, this will vary from person to person, and from company to company, but studies have shown that once employees are logging more than 40 hours per week, their productivity declines sharply. (Check this <a href=\"https://hbr.org/2015/08/the-research-is-clear-long-hours-backfire-for-people-and-for-companies\">Harvard Business Review</a> article for more) As a manager of a distributed team, it’s important to cultivate a culture that inspires your employees to work efficiently and focus on output (completed projects, etc.) rather than input (time), while also enforcing breaks, personal time vs. company time, and vacation.</p>\n<p>Not everyone is suited to remote work even if their industry supports it, and that’s ok. Some people thrive in the office, where they can interact with their teammates and coworkers face-to-face. Others need the structure and direct supervision that an office environment can provide in order to be productive. It’s one thing to find a company that is set up to support a remote team, but it’s another to determine whether working remotely is right for you. It’s unlikely that face-to-face offices will ever die out completely (humans are a social species, after all), but we’re likely to see more and more people shifting to remote work in the next decade.</p>\n<p>Do you have to be a globetrotting ‘digital nomad’ to enjoy the benefits of remote work? Absolutely not. Maybe you just want to spend more time at home with your family, or you live outside of a major metropolitan area and your local job market is more limited. Maybe you want to have face-to-face communication with your team for part of the week, and then need some quiet, uninterrupted time for writing, coding, or research in order to actually get things done. All of these are valid reasons to support remote work.</p>\n<p>Although it has been recently popularized by the digital nomad community, remote work is not a fad. Instead, it’s the future of the world economy and will only continue to catch on over the next decade.</p>\n<p>What are your thoughts on remote work? Love it, hate it, can’t wait to embrace it? Let me know below in the comments!</p>\n<hr>\n<p><em>The featured photo on this post is by <a href=\"https://unsplash.com/photos/xrVDYZRGdw4?utm_source=unsplash&#x26;utm_medium=referral&#x26;utm_content=creditCopyText\">Émile Perron</a> on <a href=\"https://unsplash.com/?utm_source=unsplash&#x26;utm_medium=referral&#x26;utm_content=creditCopyText\">Unsplash</a>, an awesome platform that provides free stock photos for digital creatives. This isn’t an affiliate link, I just think it’s really cool.</em></p>","frontmatter":{"title":"Digital Nomads and the Future of Work"}}},"pageContext":{"slug":"/digital-nomads-and-the-future-of-work/"}}